#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.eks.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0be9f882f22799ca2]
module.eks.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/MyFirstCluster/cluster]
module.eks.aws_sns_topic.alertmanager: Refreshing state... [id=arn:aws:sns:ap-northeast-1:865518846931:MyFirstCluster_alertmanager_topic]
module.eks.module.eks.aws_iam_role.this[0]: Refreshing state... [id=MyFirstCluster-cluster-20220129060345054100000001]
module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_iam_role.this[0]: Refreshing state... [id=MyFirstCluster-memory_optimized_large-eks-node-group]
module.eks.module.eks_managed_node_group["medium"].aws_iam_role.this[0]: Refreshing state... [id=MyFirstCluster-medium-eks-node-group]
module.eks.aws_iam_policy.alertmanager_publishable: Refreshing state... [id=arn:aws:iam::865518846931:policy/MyFirstCluster-alertmanager-publishable-policy]
module.eks.aws_iam_policy.alertmanager_subscribable: Refreshing state... [id=arn:aws:iam::865518846931:policy/MyFirstCluster-alertmanager-subscribable-policy]
module.eks.module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=MyFirstCluster-cluster-20220129060345054100000001-20220129060345891900000007]
module.eks.module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=MyFirstCluster-cluster-20220129060345054100000001-20220129060345888500000004]
module.eks.module.eks_managed_node_group["medium"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=MyFirstCluster-medium-eks-node-group-2022012906034598640000000a]
module.eks.module.eks_managed_node_group["medium"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=MyFirstCluster-medium-eks-node-group-20220129060345982200000009]
module.eks.module.eks_managed_node_group["medium"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=MyFirstCluster-medium-eks-node-group-20220129060345981700000008]
module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=MyFirstCluster-memory_optimized_large-eks-node-group-20220129060345890700000006]
module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=MyFirstCluster-memory_optimized_large-eks-node-group-20220129060345889900000005]
module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=MyFirstCluster-memory_optimized_large-eks-node-group-20220129060345884600000003]
module.eks.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0e277b5e645e45ff3]
module.eks.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-099d8f8f29ca320ae]
module.eks.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-05713a0cee28d43d9]
module.eks.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0b352c6ec07bd6caf]
module.eks.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a364be80932c73ff]
module.eks.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0560b22a7b7c8291f]
module.eks.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0a364be80932c73ff1080289494]
module.eks.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-00e061b9b6d784cae]
module.eks.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05a2ffc6a0bfc69a1]
module.eks.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d221d2cff6984462]
module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1005769826]
module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3896971523]
module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_udp"]: Refreshing state... [id=sgrule-1713410917]
module.eks.module.eks.aws_security_group_rule.node["egress_ntp_tcp"]: Refreshing state... [id=sgrule-1093891042]
module.eks.module.eks.aws_security_group_rule.node["egress_ntp_udp"]: Refreshing state... [id=sgrule-1068324591]
module.eks.module.eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-2666352380]
module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2678945677]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.module.eks.aws_cloudwatch_log_group.this[0] has changed
  ~ resource "aws_cloudwatch_log_group" "this" {
        id                = "/aws/eks/MyFirstCluster/cluster"
        name              = "/aws/eks/MyFirstCluster/cluster"
      + tags              = {}
        # (3 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_iam_role.this[0] has changed
  ~ resource "aws_iam_role" "this" {
        id                    = "MyFirstCluster-cluster-20220129060345054100000001"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          + "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ]
        name                  = "MyFirstCluster-cluster-20220129060345054100000001"
      + tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks.aws_security_group.node[0] has changed
  ~ resource "aws_security_group" "node" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Egress NTP/TCP to internet"
              + from_port        = 123
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 123
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Egress NTP/UDP to internet"
              + from_port        = 123
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 123
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Egress all HTTPS to internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "Node to node CoreDNS"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 53
            },
          + {
              + cidr_blocks      = []
              + description      = "Node to node CoreDNS"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = true
              + to_port          = 53
            },
        ]
        id                     = "sg-0560b22a7b7c8291f"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Node to node CoreDNS"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = true
              + to_port          = 53
            },
          + {
              + cidr_blocks      = []
              + description      = "Node to node CoreDNS"
              + from_port        = 53
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = true
              + to_port          = 53
            },
        ]
        name                   = "MyFirstCluster-node-20220129060345055200000002"
        tags                   = {
            "Name"                                 = "MyFirstCluster-node"
            "kubernetes.io/cluster/MyFirstCluster" = "owned"
        }
        # (7 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_https"] has changed
  ~ resource "aws_security_group_rule" "node" {
        id                = "sgrule-2666352380"
      + ipv6_cidr_blocks  = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_ntp_tcp"] has changed
  ~ resource "aws_security_group_rule" "node" {
        id                = "sgrule-1093891042"
      + ipv6_cidr_blocks  = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_ntp_udp"] has changed
  ~ resource "aws_security_group_rule" "node" {
        id                = "sgrule-1068324591"
      + ipv6_cidr_blocks  = []
        # (9 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
        id                       = "sgrule-3896971523"
      + ipv6_cidr_blocks         = []
      + source_security_group_id = "sg-0560b22a7b7c8291f"
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_udp"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
        id                       = "sgrule-1713410917"
      + ipv6_cidr_blocks         = []
      + source_security_group_id = "sg-0560b22a7b7c8291f"
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
        id                       = "sgrule-1005769826"
      + ipv6_cidr_blocks         = []
      + source_security_group_id = "sg-0560b22a7b7c8291f"
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] has changed
  ~ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = []
        id                       = "sgrule-2678945677"
      + ipv6_cidr_blocks         = []
      + source_security_group_id = "sg-0560b22a7b7c8291f"
        # (8 unchanged attributes hidden)
    }

  # module.eks.module.eks_managed_node_group["medium"].aws_iam_role.this[0] has changed
  ~ resource "aws_iam_role" "this" {
        id                    = "MyFirstCluster-medium-eks-node-group"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          + "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          + "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ]
        name                  = "MyFirstCluster-medium-eks-node-group"
      + tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_iam_role.this[0] has changed
  ~ resource "aws_iam_role" "this" {
        id                    = "MyFirstCluster-memory_optimized_large-eks-node-group"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          + "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          + "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ]
        name                  = "MyFirstCluster-memory_optimized_large-eks-node-group"
      + tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.aws_eks_cluster_auth.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "cluster"  {
      + id    = (known after apply)
      + name  = (known after apply)
      + token = (sensitive value)
    }

  # module.eks.data.aws_iam_policy_document.cluster_autoscaler will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cluster_autoscaler"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingGroups",
              + "autoscaling:DescribeAutoScalingInstances",
              + "autoscaling:DescribeLaunchConfigurations",
              + "autoscaling:DescribeTags",
              + "ec2:DescribeLaunchTemplateVersions",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "clusterAutoscalerAll"
        }
      + statement {
          + actions   = [
              + "autoscaling:SetDesiredCapacity",
              + "autoscaling:TerminateInstanceInAutoScalingGroup",
              + "autoscaling:UpdateAutoScalingGroup",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "clusterAutoscalerOwn"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "owned",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "true",
                ]
              + variable = "autoscaling:ResourceTag/k8s.io/cluster-autoscaler/enabled"
            }
        }
    }

  # module.eks.aws_iam_policy.cluster_autoscaler[0] will be created
  + resource "aws_iam_policy" "cluster_autoscaler" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "KarpenterControllerPolicy-refresh"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags      = {
          + "ClusterName" = "MyFirstCluster"
        }
      + tags_all  = {
          + "ClusterName" = "MyFirstCluster"
        }
    }

  # module.eks.module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this"  {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "MyFirstCluster"
      + platform_version          = (known after apply)
      + role_arn                  = "arn:aws:iam::865518846931:role/MyFirstCluster-cluster-20220129060345054100000001"
      + status                    = (known after apply)
      + tags_all                  = (known after apply)
      + version                   = (known after apply)

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = [
              + "",
            ]
          + subnet_ids                = [
              + "subnet-05713a0cee28d43d9",
              + "subnet-0b352c6ec07bd6caf",
              + "subnet-0e277b5e645e45ff3",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name" = "MyFirstCluster-eks-irsa"
        }
      + tags_all        = {
          + "Name" = "MyFirstCluster-eks-irsa"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.module.eks.aws_security_group.node[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_security_group" "node" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:865518846931:security-group/sg-0560b22a7b7c8291f" -> null
      - description            = "EKS node shared security group" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Egress NTP/TCP to internet"
              - from_port        = 123
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 123
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Egress NTP/UDP to internet"
              - from_port        = 123
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "udp"
              - security_groups  = []
              - self             = false
              - to_port          = 123
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Egress all HTTPS to internet"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "udp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
        ] -> null
      - id                     = "sg-0560b22a7b7c8291f" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
          - {
              - cidr_blocks      = []
              - description      = "Node to node CoreDNS"
              - from_port        = 53
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "udp"
              - security_groups  = []
              - self             = true
              - to_port          = 53
            },
        ] -> null
      - name                   = "MyFirstCluster-node-20220129060345055200000002" -> null
      - name_prefix            = "MyFirstCluster-node-" -> null
      - owner_id               = "865518846931" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"                                 = "MyFirstCluster-node"
          - "kubernetes.io/cluster/MyFirstCluster" = "owned"
        } -> null
      - tags_all               = {
          - "Name"                                 = "MyFirstCluster-node"
          - "kubernetes.io/cluster/MyFirstCluster" = "owned"
        } -> null
      - vpc_id                 = "vpc-0be9f882f22799ca2" -> null
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_https"] will be destroyed
  # (because key ["egress_https"] is not in for_each map)
  - resource "aws_security_group_rule" "node" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "Egress all HTTPS to internet" -> null
      - from_port         = 443 -> null
      - id                = "sgrule-2666352380" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0560b22a7b7c8291f" -> null
      - self              = false -> null
      - to_port           = 443 -> null
      - type              = "egress" -> null
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_ntp_tcp"] will be destroyed
  # (because key ["egress_ntp_tcp"] is not in for_each map)
  - resource "aws_security_group_rule" "node" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "Egress NTP/TCP to internet" -> null
      - from_port         = 123 -> null
      - id                = "sgrule-1093891042" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0560b22a7b7c8291f" -> null
      - self              = false -> null
      - to_port           = 123 -> null
      - type              = "egress" -> null
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_ntp_udp"] will be destroyed
  # (because key ["egress_ntp_udp"] is not in for_each map)
  - resource "aws_security_group_rule" "node" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "Egress NTP/UDP to internet" -> null
      - from_port         = 123 -> null
      - id                = "sgrule-1068324591" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "udp" -> null
      - security_group_id = "sg-0560b22a7b7c8291f" -> null
      - self              = false -> null
      - to_port           = 123 -> null
      - type              = "egress" -> null
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"] will be destroyed
  # (because key ["egress_self_coredns_tcp"] is not in for_each map)
  - resource "aws_security_group_rule" "node" {
      - cidr_blocks              = [] -> null
      - description              = "Node to node CoreDNS" -> null
      - from_port                = 53 -> null
      - id                       = "sgrule-3896971523" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0560b22a7b7c8291f" -> null
      - self                     = true -> null
      - source_security_group_id = "sg-0560b22a7b7c8291f" -> null
      - to_port                  = 53 -> null
      - type                     = "egress" -> null
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_udp"] will be destroyed
  # (because key ["egress_self_coredns_udp"] is not in for_each map)
  - resource "aws_security_group_rule" "node" {
      - cidr_blocks              = [] -> null
      - description              = "Node to node CoreDNS" -> null
      - from_port                = 53 -> null
      - id                       = "sgrule-1713410917" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "udp" -> null
      - security_group_id        = "sg-0560b22a7b7c8291f" -> null
      - self                     = true -> null
      - source_security_group_id = "sg-0560b22a7b7c8291f" -> null
      - to_port                  = 53 -> null
      - type                     = "egress" -> null
    }

  # module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be destroyed
  # (because key ["ingress_self_coredns_tcp"] is not in for_each map)
  - resource "aws_security_group_rule" "node" {
      - cidr_blocks              = [] -> null
      - description              = "Node to node CoreDNS" -> null
      - from_port                = 53 -> null
      - id                       = "sgrule-1005769826" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-0560b22a7b7c8291f" -> null
      - self                     = true -> null
      - source_security_group_id = "sg-0560b22a7b7c8291f" -> null
      - to_port                  = 53 -> null
      - type                     = "ingress" -> null
    }

  # module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be destroyed
  # (because key ["ingress_self_coredns_udp"] is not in for_each map)
  - resource "aws_security_group_rule" "node" {
      - cidr_blocks              = [] -> null
      - description              = "Node to node CoreDNS" -> null
      - from_port                = 53 -> null
      - id                       = "sgrule-2678945677" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "udp" -> null
      - security_group_id        = "sg-0560b22a7b7c8291f" -> null
      - self                     = true -> null
      - source_security_group_id = "sg-0560b22a7b7c8291f" -> null
      - to_port                  = 53 -> null
      - type                     = "ingress" -> null
    }

  # module.eks.module.eks_managed_node_group["medium"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "MyFirstCluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "MyFirstCluster-medium"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::865518846931:role/MyFirstCluster-medium-eks-node-group"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-05713a0cee28d43d9",
          + "subnet-0b352c6ec07bd6caf",
          + "subnet-0e277b5e645e45ff3",
        ]
      + tags                   = {
          + "Name" = "MyFirstCluster-medium"
        }
      + tags_all               = {
          + "Name" = "MyFirstCluster-medium"
        }
      + version                = "1.21"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 0
          + max_size     = 1
          + min_size     = 0
        }

      + timeouts {}

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["medium"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for medium EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "medium-"
      + tags_all               = (known after apply)
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "MyFirstCluster-medium"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name" = "MyFirstCluster-medium"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name" = "MyFirstCluster-medium"
            }
        }
    }

  # module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "MyFirstCluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "r5.large",
          + "r5a.large",
          + "r5ad.large",
          + "r5b.large",
          + "r5n.large",
          + "r4.large",
          + "z1d.large",
        ]
      + node_group_name        = "MyFirstCluster-memory_optimized_large"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::865518846931:role/MyFirstCluster-memory_optimized_large-eks-node-group"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-05713a0cee28d43d9",
          + "subnet-0b352c6ec07bd6caf",
          + "subnet-0e277b5e645e45ff3",
        ]
      + tags                   = {
          + "Name" = "MyFirstCluster-memory_optimized_large"
        }
      + tags_all               = {
          + "Name" = "MyFirstCluster-memory_optimized_large"
        }
      + version                = "1.21"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 3
          + min_size     = 0
        }

      + timeouts {}

      + update_config {
          + max_unavailable            = (known after apply)
          + max_unavailable_percentage = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["memory_optimized_large"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for memory_optimized_large EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "memory_optimized_large-"
      + tags_all               = (known after apply)
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "MyFirstCluster-memory_optimized_large"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name" = "MyFirstCluster-memory_optimized_large"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name" = "MyFirstCluster-memory_optimized_large"
            }
        }
    }

  # module.eks.module.iam_assumable_role_alertmanager.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions       = (known after apply)
          + effect        = (known after apply)
          + not_actions   = (known after apply)
          + not_resources = (known after apply)
          + resources     = (known after apply)
          + sid           = (known after apply)

          + condition {
              + test     = (known after apply)
              + values   = (known after apply)
              + variable = (known after apply)
            }

          + not_principals {
              + identifiers = (known after apply)
              + type        = (known after apply)
            }

          + principals {
              + identifiers = (known after apply)
              + type        = (known after apply)
            }
        }
    }

  # module.eks.module.iam_assumable_role_alertmanager.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "IRSA role for alertmanager"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "MyFirstCluster-alertmanager"
      + path                  = "/"
      + tags                  = {
          + "ClusterName" = "MyFirstCluster"
        }
      + tags_all              = {
          + "ClusterName" = "MyFirstCluster"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.module.iam_assumable_role_alertmanager.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::865518846931:policy/MyFirstCluster-alertmanager-publishable-policy"
      + role       = (known after apply)
    }

  # module.eks.module.iam_assumable_role_cluster_autoscaler.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions       = (known after apply)
          + effect        = (known after apply)
          + not_actions   = (known after apply)
          + not_resources = (known after apply)
          + resources     = (known after apply)
          + sid           = (known after apply)

          + condition {
              + test     = (known after apply)
              + values   = (known after apply)
              + variable = (known after apply)
            }

          + not_principals {
              + identifiers = (known after apply)
              + type        = (known after apply)
            }

          + principals {
              + identifiers = (known after apply)
              + type        = (known after apply)
            }
        }
    }

  # module.eks.module.iam_assumable_role_cluster_autoscaler.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "IRSA role for cluster autoscaler"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "cluster-autoscaler"
      + path                  = "/"
      + tags                  = {
          + "ClusterName" = "MyFirstCluster"
        }
      + tags_all              = {
          + "ClusterName" = "MyFirstCluster"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.module.iam_assumable_role_cluster_autoscaler.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

Plan: 11 to add, 0 to change, 8 to destroy.

Changes to Outputs:
  + autoscaler_role_arn = (known after apply)
  + cluster_id          = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @shogotsuneto, Action: `pull_request`*